      *>**********************************************************
      *>課題１ 1~10を繰り返し処理し足していくプログラム
      *>**********************************************************
      *>見出し部
      *>**********************************************************
       IDENTIFICATION              DIVISION.
       PROGRAM-ID.                 LOOP_SAMPLE02.
      *>**********************************************************
      *>環境部
      *>**********************************************************
       ENVIRONMENT                 DIVISION.
      *>**********************************************************
      *>データ部
      *>**********************************************************
       DATA                        DIVISION.
      *>**********************************************************
      *>作業領域の定義
      *>**********************************************************
       WORKING-STORAGE             SECTION.
           01 WK-SUJI-I              PIC 99.
           01 WK-SUJI-TOTAL          PIC 99.
      *>**********************************************************
      *>手続き部
      *>**********************************************************
       PROCEDURE DIVISION.
      *>
           MOVE  ZERO TO  WK-SUJI-I.
           MOVE  ZERO TO  WK-SUJI-TOTAL.
      *>
      *>指定回数繰り返す処理
           PERFORM VARYING
               WK-SUJI-I  FROM    0 BY 1
               UNTIL      WK-SUJI-I > 10
      *>
           COMPUTE WK-SUJI-TOTAL = WK-SUJI-TOTAL + WK-SUJI-I
      *>
       END-PERFORM.
      *>
      *>**********************************************************
      *>最終合計数を表示する
      *>**********************************************************
       DISPLAY WK-SUJI-TOTAL.
       STOP RUN.
