      *>************************************************************************
      *>FC課題2 プリント処理のプログラム
      *>************************************************************************
      *>見出し部
      *>************************************************************************
       IDENTIFICATION                DIVISION.
       PROGRAM-ID.                   PRINT002.
      *>************************************************************************
      *>環境部
      *>************************************************************************
       ENVIRONMENT                   DIVISION.
       CONFIGURATION                 SECTION.
       INPUT-OUTPUT                  SECTION.
       FILE-CONTROL.
      *>************************************************************************
      *>IN01入力ファイル
      *>************************************************************************
       SELECT   IN01-FILE     ASSIGN        TO "IN01.txt"
                              ORGANIZATION IS LINE SEQUENTIAL
                              STATUS IN-FILE-STATUS.
      *>************************************************************************
      *>PT01プリントファイル
      *>************************************************************************
       SELECT   PR01-FILE      ASSIGN         TO "PT01.txt"
                              ORGANIZATION IS LINE SEQUENTIAL.
      *>************************************************************************
      *>データ部
      *>************************************************************************
       DATA                          DIVISION.
       FILE                          SECTION.
      *>************************************************************************
      *>IN01-FILEのレイアウト定義
      *>************************************************************************
       FD   IN01-FILE.
       01   IN01-RECODE.
          03   IN01-ZYUTYU-BANGOU.
                05   IN01-MISEBAN                   PIC X(003).
                05   IN01-TYUMON-BANDOU             PIC 9(005).
      *>************************************************************************
      *>件数印刷のレイアウト定義
      *>************************************************************************
       FD   PR01-FILE.
       01   PRT-RECODE                              PIC ZZ9.
      *>************************************************************************
      *>作業領域の定義
      *>************************************************************************
       WORKING-STORAGE               SECTION.
      *>
       01   COUNT-AREA.
             03   CNT-IN01                          PIC 9(006).
      *>
      *>ステータスの領域を定義を設定する
       01   IN-FILE-STATUS                          PIC XX.
      *>************************************************************************
      *>手続き部
      *>************************************************************************
       PROCEDURE                     DIVISION.
      *>
          PERFORM   INITIAL-PROC.
      *>
          PERFORM   MAIN-PROC.
      *>
          PERFORM   FINAL-PROC.
      *>
       STOP RUN.
      *>************************************************************************
      *>初期処理
      *>************************************************************************
       INITIAL-PROC                     SECTION.
      *>
      *>  作業領域の初期化
           MOVE   ZERO    TO   CNT-IN01.
           MOVE   SPACE   TO   IN-FILE-STATUS.
      *>
       INITIAL-PROC-EXIT.
      *>
           EXIT.
      *>************************************************************************
      *>主処理
      *>************************************************************************
       MAIN-PROC                     SECTION.
      *>
      *>  ファイルのオープン
           OPEN   INPUT    IN01-FILE
                  OUTPUT   PR01-FILE.
      *>
      *>  入力ファイルの読み込み
           PERFORM  IN01-FILE-READ-PROC UNTIL
                              IN-FILE-STATUS  = "ED".
      *>
      *>  印刷処理
           PERFORM   PRINT-PROC.
      *>
       MAIN-PROC-EXIT.
      *>
           EXIT.
      *>************************************************************************
      *>終了処理
      *>************************************************************************
       FINAL-PROC                     SECTION.
      *>
      *>  ファイルのクローズ
           CLOSE   IN01-FILE
                   PR01-FILE.
      *>
       FINAL-PROC-EXIT.
      *>
           EXIT.
      *>************************************************************************
      *>IN01-FILEファイルの読み込み
      *>************************************************************************
       IN01-FILE-READ-PROC       SECTION.
      *>
           READ   IN01-FILE
               AT   END
                    MOVE "ED" TO IN-FILE-STATUS
      *>
               NOT   AT     END
      *>
               IF        IN01-RECODE = SPACE THEN
                         MOVE "END" TO IN-FILE-STATUS
      *>
               ELSE IF   IN01-RECODE >= 1 THEN
                         ADD    1      TO   CNT-IN01
      *>
           END-READ.
      *>
       IN01-FILE-READ-PROC-EXIT.
      *>
           EXIT.
      *>************************************************************************
      *>印刷処理
      *>************************************************************************
       PRINT-PROC       SECTION.

      *>
      *>      件数の代入と印刷処理
               WRITE   PRT-RECODE   FROM   CNT-IN01.
      *>
       PRINT-PROC-EXIT.
      *>
           EXIT.
