       *>1.B..+....2....+....3....+....4....+....5....+....6....+....7....+....8
       *>-----------------------------------------------------------------------
       *>サマリーのプログラムサンプル01
       *>SUMMARY_SAMPLE0001
       *>-----------------------------------------------------------------------
       IDENTIFICATION                     DIVISION.
       PROGRAM-ID.                SUMMARY_SAMPLE01.
       *>-----------------------------------------------------------------------
       *>環境部
       *>-----------------------------------------------------------------------
       ENVIRONMENT                        DIVISION.
       INPUT-OUTPUT                       SECTION.
       FILE-CONTROL.
       *>-----------------------------------------------------------------------
       *>入力ファイル
       *>-----------------------------------------------------------------------
       SELECT    IN01-FILE   ASSIGN       TO   "IN01.txt"
                             ORGANIZATION IS LINE SEQUENTIAL
                             FILE STATUS  IS IN-FILE-STATUS.
       *>-----------------------------------------------------------------------
       *>出力ファイル
       *>-----------------------------------------------------------------------
       SELECT    OT01-FILE   ASSIGN       TO   "OT01.txt"
                             ORGANIZATION IS LINE SEQUENTIAL.
       *>-----------------------------------------------------------------------
       *>データ部
       *>-----------------------------------------------------------------------
       DATA                               DIVISION.
       FILE                               SECTION.
       *>----------------------------------------------------------------------------
       *>入力ファイルのレイアウト定義
       *>----------------------------------------------------------------------------
       FD   IN01-FILE.
       01   IN01-RECODE.
            03   IN01-YEAR      PIC X(004).
            03   IN01-SUJI      PIC 99.
       *>----------------------------------------------------------------------------
       *>出力ファイルのレイアウト定義
       *>----------------------------------------------------------------------------
       FD   OT01-TYUMON-SU-FILE.
       01   OT01-RECODE.
            03   OT01-YEAR      PIC X(004).
            03   OT01-SUJI      PIC 999.
       *>-----------------------------------------------------------------------
       *>作業領域の定義
       *>-----------------------------------------------------------------------
       WORKING-STORAGE                    SECTION.
       *>
       01   IN-FILE-STATUS      PIC XX.
       *>
       01   WRK-LEY-AREA.
            03   WK-KEY-OLD     PIC X(004).
            03   WK-KEY-NEW     PIC X(004).
       *>
       01   WK-SUM-AREA.
            03   WK-SUM-SUJI    PIC 999.
       *>-----------------------------------------------------------------------
       *>初期処理
       *>-----------------------------------------------------------------------
       *>INIT-PROC                          SECTION.
       *>
             MOVE   SPACE   TO   IN-FILE-STATUS.
             MOVE   ZERO    TO   WRK-TYUMON-SU.
             MOVE   ZERO    TO   WRK-TYUMON-SU-TOTAL.
       *>
       *>    ファイルのオープン
             OPEN   INPUT    IN01-ZYUTYU-FILE
                    OUTPUT   OT01-TYUMON-SU-FILE.

       *>INIT-PROC-EXIT.
       *>
       *>    EXIT.
       *>-----------------------------------------------------------------------
       *>初期処理（ファイル読み込み処理）
       *>-----------------------------------------------------------------------
       *>IN01-ZYUTYU-FILE-READ-PROC                          SECTION.
       *>
           READ IN01-ZYUTYU-FILE
                AT     END
                DISPLAY   "READ END"
           *>
               NOT   AT   END
               MOVE   IN01-BUNRUI-CODE   TO   KEY-BUNRUI-CODE
               MOVE   IN01-SHOHIN-NO     TO   KEY-SHOHIN-NO
           *>DISPLAY"読むIN01-BUNRUI-CODE:"IN01-BUNRUI-CODE
           *>DISPLAY"読むIN01-SHOHIN-NO:"IN01-SHOHIN-NO
           END-READ.
       *>
       *>      PERFORM   SUMMARY-MAIN-PROC
       *>                                UNTIL   WRK-AT-END  =  CST-END.
       *>IN01-ZYUTYU-FILE-READ-PROC-EXIT.
       *>
       *>    EXIT.
       *>-----------------------------------------------------------------------
      *>主処理
       *>-----------------------------------------------------------------------
       PERFORM UNTIL IN-FILE-STATUS NOT = "00"
       READ IN01-ZYUTYU-FILE
       AT END
           DISPLAY "READ END"
       NOT AT END
